wrk_bench/h1_async.txt
Running 2m test @ http://127.0.0.1:8080/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 85.588ms, rate sampling interval: 258ms
  Thread calibration: mean lat.: 85.044ms, rate sampling interval: 256ms
  Thread calibration: mean lat.: 85.172ms, rate sampling interval: 257ms
  Thread calibration: mean lat.: 85.810ms, rate sampling interval: 259ms
  Thread calibration: mean lat.: 85.415ms, rate sampling interval: 258ms
  Thread calibration: mean lat.: 85.444ms, rate sampling interval: 257ms
  Thread calibration: mean lat.: 84.728ms, rate sampling interval: 255ms
  Thread calibration: mean lat.: 85.306ms, rate sampling interval: 257ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    96.78ms   44.45ms 671.23ms   88.54%
    Req/Sec     7.52k   519.12     9.10k    66.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   92.42ms
 75.000%  107.39ms
 90.000%  127.23ms
 99.000%  318.98ms
 99.900%  403.20ms
 99.990%  605.18ms
 99.999%  668.67ms
100.000%  671.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.311     0.000000            1         1.00
      57.983     0.100000       623159         1.11
      69.247     0.200000      1246236         1.25
      78.207     0.300000      1869475         1.43
      85.759     0.400000      2493687         1.67
      92.415     0.500000      3112793         2.00
      95.359     0.550000      3430032         2.22
      98.111     0.600000      3738297         2.50
     101.055     0.650000      4047148         2.86
     104.127     0.700000      4360337         3.33
     107.391     0.750000      4670736         4.00
     109.311     0.775000      4824497         4.44
     111.743     0.800000      4983427         5.00
     114.751     0.825000      5137880         5.71
     118.271     0.850000      5292544         6.67
     122.623     0.875000      5447943         8.00
     124.991     0.887500      5526644         8.89
     127.231     0.900000      5602703        10.00
     129.663     0.912500      5680729        11.43
     132.479     0.925000      5758525        13.33
     135.807     0.937500      5836332        16.00
     138.111     0.943750      5876605        17.78
     140.927     0.950000      5914711        20.00
     145.663     0.956250      5952954        22.86
     168.447     0.962500      5991622        26.67
     200.703     0.968750      6030496        32.00
     217.983     0.971875      6050001        35.56
     235.775     0.975000      6069443        40.00
     252.159     0.978125      6088886        45.71
     269.311     0.981250      6108401        53.33
     288.767     0.984375      6127789        64.00
     297.215     0.985938      6137595        71.11
     306.687     0.987500      6147195        80.00
     314.111     0.989062      6157121        91.43
     322.047     0.990625      6166655       106.67
     331.775     0.992188      6176465       128.00
     336.383     0.992969      6181253       142.22
     341.247     0.993750      6186207       160.00
     346.623     0.994531      6191148       182.86
     353.535     0.995313      6195889       213.33
     359.935     0.996094      6200767       256.00
     362.495     0.996484      6203153       284.44
     366.591     0.996875      6205578       320.00
     371.199     0.997266      6208085       365.71
     376.831     0.997656      6210481       426.67
     381.951     0.998047      6212871       512.00
     384.767     0.998242      6214172       568.89
     387.583     0.998437      6215286       640.00
     392.959     0.998633      6216520       731.43
     398.591     0.998828      6217725       853.33
     403.967     0.999023      6218962      1024.00
     408.319     0.999121      6219553      1137.78
     411.647     0.999219      6220152      1280.00
     415.999     0.999316      6220762      1462.86
     439.039     0.999414      6221351      1706.67
     457.727     0.999512      6221959      2048.00
     488.447     0.999561      6222261      2275.56
     497.151     0.999609      6222579      2560.00
     506.623     0.999658      6222868      2925.71
     522.239     0.999707      6223199      3413.33
     540.159     0.999756      6223481      4096.00
     556.543     0.999780      6223635      4551.11
     562.175     0.999805      6223814      5120.00
     578.559     0.999829      6223936      5851.43
     584.191     0.999854      6224088      6826.67
     601.087     0.999878      6224239      8192.00
     603.135     0.999890      6224313      9102.22
     605.695     0.999902      6224452     10240.00
     606.207     0.999915      6224492     11702.86
     611.327     0.999927      6224544     13653.33
     647.679     0.999939      6224638     16384.00
     648.191     0.999945      6224662     18204.44
     648.703     0.999951      6224696     20480.00
     649.727     0.999957      6224739     23405.71
     666.111     0.999963      6224769     27306.67
     667.135     0.999969      6224810     32768.00
     667.647     0.999973      6224835     36408.89
     668.159     0.999976      6224894     40960.00
     668.159     0.999979      6224894     46811.43
     668.159     0.999982      6224894     54613.33
     668.671     0.999985      6224939     65536.00
     668.671     0.999986      6224939     72817.78
     668.671     0.999988      6224939     81920.00
     668.671     0.999989      6224939     93622.86
     668.671     0.999991      6224939    109226.67
     669.183     0.999992      6224966    131072.00
     669.183     0.999993      6224966    145635.56
     669.183     0.999994      6224966    163840.00
     669.183     0.999995      6224966    187245.71
     669.695     0.999995      6224978    218453.33
     669.695     0.999996      6224978    262144.00
     669.695     0.999997      6224978    291271.11
     669.695     0.999997      6224978    327680.00
     670.207     0.999997      6224984    374491.43
     670.207     0.999998      6224984    436906.67
     670.207     0.999998      6224984    524288.00
     670.719     0.999998      6224987    582542.22
     670.719     0.999998      6224987    655360.00
     670.719     0.999999      6224987    748982.86
     671.743     0.999999      6224995    873813.33
     671.743     1.000000      6224995          inf
#[Mean    =       96.781, StdDeviation   =       44.447]
#[Max     =      671.232, Total count    =      6224995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7005095 requests in 2.00m, 13.66GB read
Requests/sec:  58376.45
Transfer/sec:    116.58MB