wrk_bench/h1_async.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.291ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.499ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.469ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.452ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.24ms    2.38ms  20.99ms   88.83%
    Req/Sec    15.77k     3.87k   39.00k    66.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50ms
 75.000%    2.20ms
 90.000%    5.27ms
 99.000%   11.89ms
 99.900%   16.18ms
 99.990%   18.64ms
 99.999%   20.17ms
100.000%   21.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.034     0.000000            1         1.00
       0.644     0.100000       292712         1.11
       0.888     0.200000       585911         1.25
       1.097     0.300000       877737         1.43
       1.298     0.400000      1170920         1.67
       1.503     0.500000      1463267         2.00
       1.611     0.550000      1609027         2.22
       1.728     0.600000      1755949         2.50
       1.858     0.650000      1901477         2.86
       2.012     0.700000      2047673         3.33
       2.203     0.750000      2194736         4.00
       2.327     0.775000      2267720         4.44
       2.485     0.800000      2340056         5.00
       2.709     0.825000      2413163         5.71
       3.077     0.850000      2486307         6.67
       3.903     0.875000      2559247         8.00
       4.579     0.887500      2595868         8.89
       5.271     0.900000      2632375        10.00
       5.959     0.912500      2669072        11.43
       6.651     0.925000      2705558        13.33
       7.363     0.937500      2742056        16.00
       7.715     0.943750      2760518        17.78
       8.067     0.950000      2778643        20.00
       8.439     0.956250      2797218        22.86
       8.839     0.962500      2815288        26.67
       9.287     0.968750      2833748        32.00
       9.535     0.971875      2842695        35.56
       9.807     0.975000      2851771        40.00
      10.111     0.978125      2860945        45.71
      10.479     0.981250      2870121        53.33
      10.903     0.984375      2879254        64.00
      11.135     0.985938      2883832        71.11
      11.391     0.987500      2888302        80.00
      11.695     0.989062      2892964        91.43
      12.023     0.990625      2897424       106.67
      12.415     0.992188      2902001       128.00
      12.623     0.992969      2904304       142.22
      12.839     0.993750      2906572       160.00
      13.087     0.994531      2908862       182.86
      13.367     0.995313      2911136       213.33
      13.687     0.996094      2913458       256.00
      13.863     0.996484      2914581       284.44
      14.095     0.996875      2915726       320.00
      14.351     0.997266      2916877       365.71
      14.647     0.997656      2917988       426.67
      14.959     0.998047      2919130       512.00
      15.135     0.998242      2919715       568.89
      15.359     0.998437      2920285       640.00
      15.631     0.998633      2920844       731.43
      15.911     0.998828      2921431       853.33
      16.223     0.999023      2921987      1024.00
      16.399     0.999121      2922271      1137.78
      16.591     0.999219      2922561      1280.00
      16.799     0.999316      2922853      1462.86
      16.991     0.999414      2923142      1706.67
      17.263     0.999512      2923422      2048.00
      17.407     0.999561      2923563      2275.56
      17.551     0.999609      2923711      2560.00
      17.679     0.999658      2923846      2925.71
      17.823     0.999707      2923987      3413.33
      17.983     0.999756      2924130      4096.00
      18.079     0.999780      2924204      4551.11
      18.191     0.999805      2924277      5120.00
      18.319     0.999829      2924354      5851.43
      18.415     0.999854      2924414      6826.67
      18.543     0.999878      2924488      8192.00
      18.607     0.999890      2924524      9102.22
      18.655     0.999902      2924559     10240.00
      18.735     0.999915      2924592     11702.86
      18.799     0.999927      2924629     13653.33
      18.959     0.999939      2924666     16384.00
      19.007     0.999945      2924683     18204.44
      19.087     0.999951      2924702     20480.00
      19.183     0.999957      2924717     23405.71
      19.327     0.999963      2924734     27306.67
      19.519     0.999969      2924752     32768.00
      19.647     0.999973      2924762     36408.89
      19.839     0.999976      2924771     40960.00
      19.983     0.999979      2924779     46811.43
      20.047     0.999982      2924788     54613.33
      20.111     0.999985      2924799     65536.00
      20.127     0.999986      2924804     72817.78
      20.143     0.999988      2924808     81920.00
      20.159     0.999989      2924811     93622.86
      20.207     0.999991      2924817    109226.67
      20.223     0.999992      2924821    131072.00
      20.223     0.999993      2924821    145635.56
      20.255     0.999994      2924827    163840.00
      20.255     0.999995      2924827    187245.71
      20.271     0.999995      2924831    218453.33
      20.271     0.999996      2924831    262144.00
      20.271     0.999997      2924831    291271.11
      20.287     0.999997      2924834    327680.00
      20.287     0.999997      2924834    374491.43
      20.303     0.999998      2924836    436906.67
      20.303     0.999998      2924836    524288.00
      20.303     0.999998      2924836    582542.22
      20.335     0.999998      2924838    655360.00
      20.335     0.999999      2924838    748982.86
      20.335     0.999999      2924838    873813.33
      20.847     0.999999      2924839   1048576.00
      20.847     0.999999      2924839   1165084.44
      20.847     0.999999      2924839   1310720.00
      20.895     0.999999      2924840   1497965.71
      20.895     0.999999      2924840   1747626.67
      20.895     1.000000      2924840   2097152.00
      20.895     1.000000      2924840   2330168.89
      20.895     1.000000      2924840   2621440.00
      21.007     1.000000      2924841   2995931.43
      21.007     1.000000      2924841          inf
#[Mean    =        2.241, StdDeviation   =        2.378]
#[Max     =       20.992, Total count    =      2924841]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543309 requests in 1.00m, 6.91GB read
Requests/sec:  59055.26
Transfer/sec:    117.93MB